#!/usr/bin/python
# -*- coding:utf-8 -*-
import sys
reload(sys)
sys.setdefaultencoding('utf-8')
sys.path.append("..")
import logging.config
import re
import xml.dom.minidom as Dom


#
# str = '''我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我 我我我我我我我我我我我我我我我我我我我我我我我我我我我我
#
#
# 我我我我我我我我我我我我我我我我
#
#
#
# 我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我    我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我'''
#
#
# unicode_str = unicode(str,'utf-8')
#
# unicode_list = []
# str_len = 0
# split_list = []
# for s in unicode_str:
#     s_len = s.encode("utf-8")
#     str_len = str_len + len(s_len)
#     if str_len >= 5000:
#         s_len = s.encode("utf-8")
#         unicode_list.append(split_list)
#         split_list = [s]
#         str_len = len(s_len)
#     else:
#
#         split_list.append(s)
#
#
# if len(split_list) > 0:
#     unicode_list.append(split_list)
#
# result = []
# for s in unicode_list:
#     strs = ''.join(i for i in s)
#     result.append(strs)

body = '''<?xml version="1.0" encoding="utf-8"?>
<data>
	<info>
		<title>无声的战斗：一个魔兽世界里聋哑人公会的故事_17173魔兽世界专区_17173.com中国游戏第一门户站</title>
		<keywords>魔兽,新闻,魔兽世界,wow,17173魔兽世新闻</keywords>
		<description>无声的战斗：一个魔兽聋哑人公会的故事</description>
	</info>
	<article>
		<content>
无声的战斗：一个魔兽世界里聋哑人公会的故事


</content>
		<img>1a9f0fadf89740869407e0a5024bf5bc_812026eb4affb496052fc24565a0cfcf.jpg</img>
		<img>1a9f0fadf89740869407e0a5024bf5bc_bd9fa5632b1d4b0286d4e4bfee125756.jpg</img>
		<img>1a9f0fadf89740869407e0a5024bf5bc_8ee17bb712409858bf0075bea3a24e7a.jpg</img>
		<content>
　　“开团，上YY”，通常是我们每次公会活动里的第一句话。进了聊天房，象征着今夜的活动正式开始。指挥在语音里解释BOSS机制，安排战术;推过了BOSS，分分装备，怼怼出了橙装的欧皇;灭了团，喷喷犯错的逗比，安慰下失误的妹子。虽然不是每个人都会在语音里说话，但是因为了有语音，魔兽才得以完整。　　但是假如，魔兽没有语音。　　假如，这个世界都没有了声音。会怎样?　　今天，让我们来看看Undaunted公会的故事，这个公会的特别之处在于，这是一个由聋哑人组成的公会。他们在无声的世界里全通了军团再临的第一级团本，史诗难度翡翠梦魇。　　US-Ner'zhul服务器，服务器排名第11　　Joseph
Antle是魔兽世界的一个老玩家。60年代，他加入的公会名叫Blackguard，他的牛头猎人一路打过熔火之心，黑翼之巢，安其拉神殿等团本。Antle至今还记得，当年不小心开了哈卡灭了团，结果被其他团员横眉冷对了好一阵子。　　魔兽世界的团本是这个游戏的精华所在，难度自然也不可低估。能找到24个各司其职的队友只是个开始：团本里的每一个BOSS几乎都有着各自的特殊技能，不仅需要玩家眼疾手快，还需要团员之间的精准配合。有时，只要一个人失误，全团就会灭掉，重新来过。　　因此，对于愿意挑战团本的公会来说，语音聊天就成为了必备的工具。“上YY，房间号XXXXXXXX”成为了很多公会每晚活动的第一句话。语音聊天不仅降低了BOSS的难度，更提高了游戏的乐趣。然而Antle却从来没有体验过这样的乐趣，他的魔兽游戏之旅显得更加孤单，因为他是一个聋哑人。　　“确实很无聊，团里的人都在聊天，恐怕没人能够理解我的这份孤单。在打本的时候，公会官员会特意密我‘你负责月亮’或者‘你负责第3次驱散’之类的话。”Antle这样说到，“BOSS机制不复杂还好，我只要保命加输出就可以，也不会给我安排难度高的任务，他们觉得上语音才行。”　　魔兽世界本来就是个多人游戏，打团本更不能少了交流。和你一起打过BOSS灭过团的人会成为你这辈子的好友。可惜，Antle难以获得这份喜悦和荣耀，他无法在首杀BOSS后加入队友的欢呼。不过，在2013年，他加入Undaunted公会后，这一切发生了改变。　　2011年，一群线下聋哑人玩家社群在魔兽世界里建立了Undaunted公会(此前是Durus
Veritas)。他们都是团本的老手，不用语音聊天也能不断挑战高端团本。他们战绩卓越，从大灾变版本一路杀进军团再临。在2017年1月15日，他们成功地打通了军团再临第一级团本――史诗难度翡翠梦魇　　2013年，Antle通过熟人介绍，成为了Undaunted公会的10人团DPS。今天，他已经成为了公会会长，重新练了一个血精灵防骑。　　　Undaunted公会如何打团本　　Undaunted公会在开团前会做大量的准备工作。常见的一些插件自不会少，但是因为无法通过声音来识别游戏机制，他们还安装了许多能在聊天框里提示BOSS技能的插件。打团的难度对于他们来说更高，要知道，史诗难度下，就算比较简单的BOSS比如尼珊德拉也有一次心控7个团员的技能。只能用聊天打字交流，加上各种提示就会变得非常混乱。　　“比如坦克忘记嘲讽，另外一个坦克就要打字来提示。”Antle说：“我们也要在开打前分配任务，最重要的就是治疗大招。不分配任务，我们肯定打不过BOSS。一般，前几次灭团都是为了让团员各自熟悉自己的任务，这也提高了我们的团本意识和战斗素养。”　　这么多年的魔兽世界资料片中，暴雪设计的团本首领战成百上千。其中大部分，如果没有语音聊天就会变得非常困难，但困难意味着还有可能。Undaunted公会做了很多努力才有今天的成就，即便无法语音交流，他们也会开聊天室来交流BOSS战术。确实，打通史诗难度翡翠梦魇并不是什么稀罕事，这一成就也意味着你的公会已经将大部分普通公会甩在了身后。Antle解释说，每次灭团后，由于无法用言语沟通，大家必须各自打字，说明自己需要的战术调整，这需要花费大量时间。那么，有没有对聋哑人来说难到不公平的战斗呢?只有一个。　　“史诗难度的萨维斯。如果有人在刚刚要进入梦境时死掉了，那就肯定灭团。”Antle说。“柱子出来没人进就会出小怪，出小怪就会让战斗难度大幅度提高，治疗DPS压力极大。如果我们可以立刻指派其他人替代战死队友，这个机制就不会那么难处理。”　　显然，让暴雪为专门为聋哑人而限制自己的首领战设计不大可能。但是，这种特别需要语音交流才能处理的机制却是Undaunted公会心中的痛。实际上，有很多热门游戏从来就没有考虑过聋哑人这一特殊群体：彩虹六号里的脚步声，Thumper里的迷幻音效，还有神秘岛里只能通过音效才能破解的谜题。声音对于我们来说，是那么的理所当然。　　我们同情聋哑人，但是并没能真正关心过他们。如今，大部分游戏里都有色盲选项，但极少的游戏里会有听力障碍选项。　　在最近的守望先锋reddit讨论版里，许多有听力障碍的玩家也表示过，游戏里的大招无法通过音效以外的方法来辨别。也许很多人从来都没有想过这件事，但无论是秩序之光的传送门，还是狂鼠的炸弹轮胎，没听到提示音效，这个游戏的难度就会大大增加。　　其实Antle曾特意就这一问题问过暴雪的开发者：“能不能增加一些额外字符来提示这些机制。”但是暴雪的回答却令人十分无奈――“这个问题很难回答，因为我们并不理解这里缺少的内容。”　　当然，排开这些苦闷，Undaunted公会的每一个人都为自己成功打通史诗翡翠梦魇而自豪。他们不用麦克风一样屠掉了这头“巨龙”。在萨维斯倒下的瞬间，Antle再也不必对着冷清的聊天框，幻想聊天室里大家的一片沸腾，取而代之的是公会频道里不断的文字刷屏。他再也不用因为自己的特殊而受到特殊照顾，他不仅能够处理掉这些复杂的BOSS机制，更能够带着自己的团员，一起体验到最真实的魔兽团本内容。　　“不依靠语音交流，我们也一样击败游戏最困难的战斗，我们非常自豪。我们的团员有着卓越的战斗意识，能够完成分配给自己的任务。”Antle说：“目前，暗夜要塞我们进度也到了英雄模式9/10(截止发稿日期，Undaunted已经在开荒史诗暗夜了)，在我们服务器，我们是全服第8的公会。这对我们来说亦是一项极大的成就，但是，这并不是终点，我们会继续向前。”　　击杀英雄难度古尔丹　　在这个堪称快餐的时代，仍有一群a人在坚持着走自己的游戏之路。当我们总是在抱怨魔兽和以前不在一样时，有没有静下心好好的思考过，变得可能不是魔兽，而是我们?

</content>
		<img>1a9f0fadf89740869407e0a5024bf5bc_e99cb3a2539d603402aec4e587bf738f.jpg</img>
	</article>
</data>
'''

xml_dom = Dom.parseString(body)
node_root = xml_dom.documentElement
title_node = node_root.getElementsByTagName('title')

title_node[0].lastChild.nodeValue = 'aaa'


content_node = node_root.getElementsByTagName('content')
for content in content_node:
    content.lastChild.nodeValue = content.lastChild.nodeValue + 'aaa'

# print data[0].lastChild.nodeValue
print xml_dom.toprettyxml(indent = "\t", newl = "\n", encoding = "utf-8")


